Revit 2024 API
BuiltInFailures.CreationFailures.CannotCreateCurtainGrid Property
 Can't create Curtain Wall Grid Line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateCurtainGrid { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateCurtainGrid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateCurtainGrid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace